# 2
# Дано n-значное целое число N. Определить: входят ли в него цифры 3 и 7.

number = int(input('Введите число: '))
print('3' in str(number) and '7' in str(number))